# FillColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingDisplayGraphicSettings..::..FillColor Property
WorksharingDisplayGraphicSettings Class See Also
---
The fill color that will be applied to elements when these settings are applied. Note that this is automatically set by increasing the luma of the specified line color by 65%.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Color FillColor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FillColor As Color
	Get
```

Visual C++
---
```text
public:
property Color^ FillColor {
	Color^ get ();
}
```

# See Also
WorksharingDisplayGraphicSettings Class
Autodesk.Revit.DB Namespace